---
kind: other
id: Methods.T:Autodesk.Revit.DB.TransactionGroup
source: html/65b49d46-88ec-9b8d-cd92-e3d9b2392994.htm
---
# TransactionGroup Methods

Assimilates all inner transactions by merging them into a single undo item.